# GetFailureDefinitionId Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FailureMessageAccessor..::..GetFailureDefinitionId Method
FailureMessageAccessor Class See Also
---
Retrieves the Id of the FailureDefinition of the failure.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public FailureDefinitionId GetFailureDefinitionId()
```

Visual Basic
---
```text
Public Function GetFailureDefinitionId As FailureDefinitionId
```

Visual C++
---
```text
public:
FailureDefinitionId^ GetFailureDefinitionId()
```

# ### Return Value
The Id of the FailureDefinition of the failure.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This FailureMessageAccessor has not been properly initialized. |

# See Also
FailureMessageAccessor Class
Autodesk.Revit.DB Namespace